export class MisspelledWordsPage {
  private pageOffset = 7
  private pages = [
    {
      section: 'အသံထွက်မှန်မှ',
      pageNum: 1,
      entries: {
        'ကသတ်သံဖြင့်ဖတ်': 2,
        'ငသတ်သံဖြင့်ဖတ်': 4,
        'ဌာန်တူသော်လည်း': 6,
        'သံတူသံယောင်သတိဆောင်': 11
      }
    },
    {
      section: 'အက္ခရာနှင့်ကိန်းဂဏန်းရေးဆွဲပုံ',
      pageNum: 15,
      entries: {
        'ဝိုက်ချ မောက်ချ': 16,
        'ကိန်းဂဏန်းသင်္ကေတရေးဆွဲပုံ': 17,
        'ဂငယ် နှင့် ရှစ်': 18,
        'ရကောက် နှင့် ခုနစ်': 19,
        'ဌ နှင့် ဋ္ဌ': 20,
        'ဉကလေး နှင့် ညကြီး': 21,
        'ဍ နှင့် ၒ ဆင့်ပုံ': 22
      }
    },
    {
      section: 'စာလုံးပေါင်းသတ်ပုံ',
      pageNum: 23,
      entries: {
        'ပဲ နှင့် ဘဲ': 25,
        'ဖက် နှင့် ဘက်': 28,
        'ဖူး၊ ဘူး': 31,
        'အနက်စွဲ အသံစွဲ': 35,
        'မီ၊ မှီ': 40,
        'မင် နှင့် မြား': 43,
        'မလိုအပ်ဘဲပိုတတ်သောရေးချ': 46,
        'ဖြည်းဖြည်း': 52,
        'ရောထွေးတတ်သော ကာ နှင့် ခါ': 54,
        'မှားတတ်သော ပါဠိပါဌ်ဆင့်စာလုံးများ': 56
      }
    },
    {
      section: 'သဒ္ဒါအသုံးအနှုန်း',
      pageNum: 57,
      entries: {
        'ရောထွေးတတ်သော မှ နှင့် က': 58,
        'အသုံးမမှား ကို နှင့် အား': 61,
        'သတိပြုလေ တို့၊ များ၊ တွေ': 64,
        'အတိတ်ကို ရည်ညွှန်းလိုတိုင်းခဲ့သုံးရန်မလို': 67,
        'နှင့်ပို ဖြင့်ပို': 70,
        'တစ်မျိုးသာသုံးပါ': 72,
        'ခွဲခြားသိစရာ သည် နှင့် မှာ': 76,
        'နည်းတူ၊ ကဲ့သို့ ခွဲသိဖို့': 78,
        'ဆယ်ပြည့်ကိန်းများကို ရေတွက်သော်': 81
      }
    },
    {
      section: 'ဝါကျဖွဲ့စည်းပုံ',
      entries: {
        'ဝါကျအထားအသို': 84,
        'ဝါကျဖွဲ့စည်းပုံ မညီညွတ်ခြင်း': 95,
        'ဝါကျတွင်း ဖွဲ့စည်းပုံ ပိုခြင်း၊ လိုခြင်း': 100
      }
    }
  ]
  private accordion: Element

  attached () {
    jQuery(this.accordion).accordion({
      onOpen: function () {
        jQuery(this)[0].scrollIntoView()
      }
    })
  }

  getPageEntries (page) {
    return Object.keys(page.entries)
  }

  closeAll () {
    jQuery(this.accordion).accordion('close others')
    document.querySelector('h1').scrollIntoView()
  }
}
